[
  {
    "item_id": "job_001",
    "title": "AI Engineer",
    "text": "Design and implement machine learning models and AI systems. Work with neural networks, NLP, and computer vision. Requires Python, TensorFlow/PyTorch experience."
  },
  {
    "item_id": "job_002",
    "title": "Game Developer",
    "text": "Create video games using game engines like Unity or Unreal. Design gameplay mechanics, implement graphics, and optimize performance. Knowledge of C++ or C# required."
  },
  {
    "item_id": "job_003",
    "title": "Data Scientist",
    "text": "Analyze large datasets to extract insights and build predictive models. Use statistical methods and machine learning. Requires Python, SQL, and statistics knowledge."
  },
  {
    "item_id": "job_004",
    "title": "Full Stack Developer",
    "text": "Build web applications from frontend to backend. Work with React, Node.js, databases. Create responsive UIs and RESTful APIs."
  },
  {
    "item_id": "job_005",
    "title": "DevOps Engineer",
    "text": "Manage cloud infrastructure and CI/CD pipelines. Automate deployments using Docker, Kubernetes. Monitor system performance and reliability."
  },
  {
    "item_id": "job_006",
    "title": "Cybersecurity Analyst",
    "text": "Protect systems from cyber threats. Conduct security audits, monitor for breaches, implement security protocols. Knowledge of networking and security tools required."
  },
  {
    "item_id": "job_007",
    "title": "Mobile App Developer",
    "text": "Build iOS and Android applications. Use Swift, Kotlin, or cross-platform frameworks like Flutter or React Native. Focus on user experience and performance."
  },
  {
    "item_id": "job_008",
    "title": "Cloud Architect",
    "text": "Design cloud-based solutions on AWS, GCP, or Azure. Plan infrastructure, optimize costs, ensure scalability and security."
  },
  {
    "item_id": "job_009",
    "title": "UX Designer",
    "text": "Create user-centered designs for digital products. Conduct user research, create wireframes and prototypes. Work with Figma, Sketch, or Adobe XD."
  },
  {
    "item_id": "job_010",
    "title": "Product Manager",
    "text": "Define product vision and roadmap. Work with engineering and design teams. Prioritize features based on user needs and business goals."
  },
  {
    "item_id": "job_011",
    "title": "MLOps Engineer",
    "text": "Deploy and maintain machine learning models in production. Build ML pipelines, monitor model performance, manage model versioning."
  },
  {
    "item_id": "job_012",
    "title": "Blockchain Developer",
    "text": "Build decentralized applications and smart contracts. Work with Ethereum, Solidity, Web3. Understand cryptography and distributed systems."
  },
  {
    "item_id": "job_013",
    "title": "QA Engineer",
    "text": "Ensure software quality through testing. Write automated tests, perform manual testing, track bugs. Use Selenium, Jest, or similar tools."
  },
  {
    "item_id": "job_014",
    "title": "Technical Writer",
    "text": "Create documentation for software products. Write user guides, API documentation, tutorials. Translate technical concepts for various audiences."
  },
  {
    "item_id": "job_015",
    "title": "Robotics Engineer",
    "text": "Design and program robots and autonomous systems. Work with sensors, actuators, and control systems. Knowledge of ROS and embedded systems."
  }
]